#include "lcd_1602.h"																	// Подключение библиотеки LCD экрана
#include "delays.h"																		// Подключение библиотеки задержек

const uint8_t ROW_16[] = {0x00, 0x40, 0x10, 0x50};		// Массив адресов начала строк LCD экрана

/*-------------------------------------------------------------------------------------
																Передача команды или данных
---------------------------------------------------------------------------------------*/
void LCD_Write(uint8_t data)													// Передача данных на D0-D7 через GPIOB
{
	uint16_t SentData = (data << 3) | (READ_REG(GPIOB->IDR) & 0xF807);	// Изменение только битов с RB3 по RB10 в GPIOB
	WRITE_REG(GPIOB->ODR, SentData);										// Запись данных SentData в GPIOB
	LCD_Set_E; 																					// Разрешена передача данных
	Delay_ms(1); 																				// Временная задержка 1 мс
	LCD_Reset_E; 																				// Запрещена передача данных
	Delay_ms(1);																				// Временная задержка 1 мс
	SentData = 0x00 | (READ_REG(GPIOB->IDR) & 0xF807);	// Изменение только битов с RB3 по RB10 в GPIOB
	WRITE_REG(GPIOB->ODR, SentData);										// Очистка битов с RB3 по RB10 в GPIOB
}

/*-------------------------------------------------------------------------------------
																	Запись команд (RS = 0)
---------------------------------------------------------------------------------------*/
void LCD_Write_Command(uint8_t command)
{
	LCD_Reset_RS;			 																	// Переход в режим передачи команд
	LCD_Write(command);																	// Запись команды
}

/*-------------------------------------------------------------------------------------
																	Запись данных (RS = 1)
---------------------------------------------------------------------------------------*/
void LCD_Write_Data(uint8_t data)
{
	LCD_Set_RS; 																				// Переход в режим передачи данных
	LCD_Write(data);																		// Запись данных
}

/*-------------------------------------------------------------------------------------
																Установка позиции курсора
---------------------------------------------------------------------------------------*/
void LCD_Cursor(uint8_t row, uint8_t col)							// Установка позиции курсора (номер строки, номер столбца)
{
	LCD_Write_Command(SET_DDRAM_ADDR + ROW_16[row] + col);	// Установка курсора
}
