#ifndef __LCD_1602_H								// Проверка, что библиотека не подключена
#define __LCD_1602_H

#include "stm32f10x.h"							// Подключение библиотеки МК

/*-------------------------------------------------------------------------------------
													Директивы команд управления дисплеем
---------------------------------------------------------------------------------------*/
#define FUNCTION_SET 0x20						// Установка функций
#define OPT_DL 0x10									// Использование 8-разрадов D0-D7	(по умолчанию 4-разряда D0-D3)
#define OPT_N 0x08									// Установка двустрочного дисплея	(по умолчанию - однострочный)
#define OPT_F 0x04									// Установка размера символа 5x11 (по умолчанию: 5x8)

#define CLEAR_DISPLAY 0x01					// Очистка дисплея

#define DISPLAY_ON_OFF_CONTROL 0x08	// Параметры отображения
#define OPT_D	0x04									// Дисплей включён (по умолчанию выключен)
#define OPT_C	0x02									// Курсор включен (по умолчанию выключен)
#define OPT_B 0x01									// Мигание курсора (по умолчанию выключен)

#define ENTRY_MODE_SET 0x04					// Настройка режима входа
#define OPT_ID 0x02									// Курсор перемещается вправо и адрес в памяти инкрементируется (по умолчанию: перемещается влево и адрес в памяти декрементируется)
#define OPT_SH	0x01								// Смещение символов дисплея (по умолчанию без смещения)


#define RETURN_HOME 0x02						// Возвращение курсора в начальную позицию

#define CURSOR_DISPLAY_SHIFT 0x10		// Сдвиг курсора или дисплея
#define OPT_SC 0x08
#define OPT_RL 0x04

#define SET_CGRAM_ADDR 0x040				// Установка адреса памяти CGRAM
#define SET_DDRAM_ADDR 0x80					// Установка адреса памяти DDRAM

/*-------------------------------------------------------------------------------------
													Директивы управляющих сигналов E и RS
---------------------------------------------------------------------------------------*/
#define LCD_Set_E 		WRITE_REG(GPIOB->BSRR, GPIO_BSRR_BS13) // Разрешена передача данных/команд
#define LCD_Reset_E 	WRITE_REG(GPIOB->BSRR, GPIO_BSRR_BR13) // Запрещена передача данных/команд
#define LCD_Set_RS 		WRITE_REG(GPIOB->BSRR, GPIO_BSRR_BS12) // Режим передачи данных
#define LCD_Reset_RS 	WRITE_REG(GPIOB->BSRR, GPIO_BSRR_BR12) // Режим передачи команд

/*-------------------------------------------------------------------------------------
																Прототипы функций
---------------------------------------------------------------------------------------*/
void LCD_Write_Command(uint8_t command);
void LCD_Write_Data(uint8_t data);
void LCD_Write(uint8_t data);
void LCD_Cursor(uint8_t row, uint8_t col);

#endif
